# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [3]:
import pandas as pd
import sqlite3
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Display the names of all the employees in Boston.
Hint: join the employees and offices tables.

In [11]:
cur.execute(""" SELECT firstName, lastName FROM employees e join offices o ON e.officeCode == o.officeCode
                WHERE city == 'Boston'""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by.

In [20]:
cur.execute(""" SELECT count(*) FROM employees e join offices o ON e.officeCode == o.officeCode
                GROUP BY city""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

   count(*)
0         2
1         2
2         2
3         5
4         6
5         4
6         2

## Write 3 Questions of your own and answer them

In [8]:
# Answers will vary
# Example: Display the htmlDescription and employee's first and last name for each product that each employee has sold

In [29]:
# How many products are in each product line?
cur.execute(""" SELECT productLine, count(productCode) as COUNT FROM  products pr JOIN productlines pl USING(productLine)
                GROUP BY productLine""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

        productLine  COUNT
0      Classic Cars     38
1       Motorcycles     13
2            Planes     12
3             Ships      9
4            Trains      3
5  Trucks and Buses     11
6      Vintage Cars     24

In [34]:
# How many orders did the customers of each city purchase
cur.execute(""" SELECT city, COUNT(orderNumber) AS count FROM orders o JOIN customers c on o.customerNumber == c.customerNumber
                GROUP BY city
                ORDER BY count DESC""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

         city  count
0      Madrid     31
1  San Rafael     17
2         NYC     16
3  Auckland        9
4       Paris      9

In [39]:
# How many customers was each employee responsible for?
cur.execute(""" SELECT employeeNumber, COUNT(customerNumber) as customerCount FROM employees e JOIN customers c 
            ON e.employeeNumber == c.salesRepEmployeeNumber
            GROUP BY employeeNUmber
            ORDER BY customerCount DESC""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

   employeeNumber  customerCount
0            1401             10
1            1504              9
2            1323              8
3            1501              8
4            1286              7
5            1370              7
6            1165              6
7            1166              6
8            1188              6
9            1216              6
10           1337              6
11           1702              6
12           1611              5
13           1612              5
14           1621              5

## Level Up: Display the names of every individual product that each employee has sold

In [13]:
# Your code here

## Level Up: Display the Number of Products each employee has sold

In [15]:
# Your code here

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!